Repository: MatiasNAmendola/KoolDevelop
Catalog: application/international/*/default.po
Languages: nl

source: Home
nl: Startpagina

source: Author
nl: Ontwikkelaar

source: Search in tips…
nl: Zoeken in tips…

source: Security
nl: Veiligheid

source: Model-View-Controler
nl: Model-View-Controller

source: KoolDevelop demonstration website
nl: KoolDevelop voorbeeld applicatie

source: This simple application demonstrates the use of the KoolDevelop framework. Go trough the code to learn it quickly.
nl: Deze simpele applicatie laat de werking van het KoolDevelop framework zien. Neem een kijkje in de code om het snel te leren.

source: Namespace based
nl: Gebruikt Namespaces

source: The framework utilizes PHP namespaces fully, allowing easy inclusion of external libraries. It has an easy to configure AutoLoader for internal files and a PSR-0 compatible autoloader for external dependancies.
nl: Het framework gebruikt PHP Namespaces volledig. Dit versimpelt het laden van externe libraries en maakt de applicatie toekomstbestendig. Het framework heeft een simpel configureerbaar PSR-0 compatible autoloader.

source: The framework has a clear usage of the Model-View-Controller pattern helping you to write clean, understandible code. All parts of this pattern are loosly coupled.
nl: Thet framework is opgebouwd rond het Model-View-Controller pattern. Het helpt de ontwikkelaar een goed gestructureerde applicatie te ontwikkelen. Alle onderdelen van het pattern zijn goed ontkoppeld opgezet.

source: No tricks
nl: Geen magie

source: The framework plays no tricks, it helps you where it can, but it doesn't do much without you telling it to. This prevents high loads, bloated applications and unexpected/untraceable problems.
nl: Het framework heeft geen geheime trucs. Het helpt je waar het kan maar zal niet iets doen zonder dat jij daar opdracht toe geeft. Dit voorkomt een hoge load, onnodig grote en complexe applicaties en onverwachte problemen.

source: The framework includes a lightweight Fluent database adaptor for SQL databases utilizing prepared statements for speed and security.
nl: Het framework heeft een lichtgewicht Fluent database adapter voor SQL databases die gebruikt maakt van prepared statements voor snelheid en veiligheid.

source: No templating engine that adds yet another layer of obfuscation but pure PHP view files with some powerfull utilties like Elements (reusable mini-views), Helpers (simple to load view libraries) and Placeholders
nl: Geen templating engine die nog eens een extra laag van obfuscatie toevoegd maar een pure PHP view met een paar krachtige tools zoals Elements (herbruikbare mini Views), Helpers (simpel te laden libraries voor Views) en Placeholders.

source: In layout or in a view/element
nl: In een layout of view

source: Easy configuration
nl: Gemakkelijke configuratie

source: No large amount of configuration files to edit. Every major part of the framework has it's own .ini file. You only need to configure what you use.
nl: Geen grote hoeveelheid configuratie instellingen om te wijzigen. Ieder deel van het framework heeft een eigen .ini bestand, je hoeft alleen te configureren wat je gebruikt.
